The solution is failing to do the elements are not in the same Design Option.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DesignOptionConflictWarning { get; }
  Visual Basic
Public Shared ReadOnly Property DesignOptionConflictWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DesignOptionConflictWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace